In [5]:
import matplotlib.pyplot as plt
import pandas as pd
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split

In [30]:
df = pd.read_csv('data/scores.csv')

### First 5 rows of Dataframe

In [32]:
df.head()

,School ID,School Name,Borough,Building Code,Street Address,City,State,Zip Code,Latitude,Longitude,...,End Time,Student Enrollment,Percent White,Percent Black,Percent Hispanic,Percent Asian,Average Score (SAT Math),Average Score (SAT Reading),Average Score (SAT Writing),Percent Tested
0,02M260,Clinton School Writers and Artists,Manhattan,M933,425 West 33rd Street,Manhattan,NY,10001,40.75321,-73.99786,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,06M211,Inwood Early College for Health and Informatio...,Manhattan,M052,650 Academy Street,Manhattan,NY,10002,40.86605,-73.92486,...,3:00 PM,87.0,3.4%,21.8%,67.8%,4.6%,NaN,NaN,NaN,NaN
2,01M539,"New Explorations into Science, Technology and ...",Manhattan,M022,111 Columbia Street,Manhattan,NY,10002,40.71873,-73.97943,...,4:00 PM,1735.0,28.6%,13.3%,18.0%,38.5%,657.0,601.0,601.0,91.0%
3,02M294,Essex Street Academy,Manhattan,M445,350 Grand Street,Manhattan,NY,10002,40.71687,-73.98953,...,2:45 PM,358.0,11.7%,38.5%,41.3%,5.9%,395.0,411.0,387.0,78.9%
4,02M308,Lower Manhattan Arts Academy,Manhattan,M445,350 Grand Street,Manhattan,NY,10002,40.71687,-73.98953,...,3:00 PM,383.0,3.1%,28.2%,56.9%,8.6%,418.0,428.0,415.0,65.1%

### Show description of data set

In [33]:
df.describe()

,Zip Code,Latitude,Longitude,Student Enrollment,Average Score (SAT Math),Average Score (SAT Reading),Average Score (SAT Writing)
count,435.000000,435.000000,435.000000,428.000000,375.000000,375.000000,375.000000
mean,10726.096552,40.745472,-73.921072,702.357477,432.944000,424.504000,418.458667
std,537.927907,0.080937,0.071705,759.176061,71.952373,61.881069,64.548599
min,10001.000000,40.528230,-74.192150,62.000000,317.000000,302.000000,284.000000
25%,10301.500000,40.690495,-73.979260,357.250000,386.000000,386.000000,382.000000
50%,10472.000000,40.741210,-73.925140,466.000000,415.000000,413.000000,403.000000
75%,11217.000000,40.822095,-73.882580,623.250000,458.500000,445.000000,437.500000
max,11694.000000,40.888370,-73.726910,5447.000000,754.000000,697.000000,693.000000

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 435 entries, 0 to 434
Data columns (total 22 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   School ID                    435 non-null    object
 1   School Name                  435 non-null    object
 2   Borough                      435 non-null    object
 3   Building Code                435 non-null    object
 4   Street Address               435 non-null    object
 5   City                         435 non-null    object
 6   State                        435 non-null    object
 7   Zip Code                     435 non-null    int64
 8   Latitude                     435 non-null    float64
 9   Longitude                    435 non-null    float64
 10  Phone Number                 435 non-null    object
 11  Start Time                   431 non-null    object
 12  End Time                     431 non-null    object
 13  Student Enrollment           428 non-null    float64
 14  Percent White                428 non-null    object
 15  Percent Black                428 non-null    object
 16  Percent Hispanic             428 non-null    object
 17  Percent Asian                428 non-null    object
 18  Average Score (SAT Math)     375 non-null    float64
 19  Average Score (SAT Reading)  375 non-null    float64
 20  Average Score (SAT Writing)  375 non-null    float64
 21  Percent Tested               386 non-null    object
dtypes: float64(6), int64(1), object(15)
memory usage: 74.9+ KB

In [36]:
df[['Zip Code']].head(20)

    Zip Code
0      10001
1      10002
2      10002
3      10002
4      10002
5      10002
6      10002
7      10002
8      10002
9      10002
10     10002
11     10002
12     10002
13     10003
14     10003
15     10003
16     10003
17     10003
18     10003
19     10003